CircuitMess/Arduino-ESP8266/boards.txt
menu.BoardModel=Model
menu.ESPModule=Module
menu.led=Builtin Led
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=Exceptions
menu.wipe=Erase Flash
menu.sdk=Espressif FW
menu.ssl=SSL Support


##############################################################

nibble.name=Nibble
nibble.build.board=ESP8266_NIBBLE
nibble.build.variant=nibble
nibble.upload.tool=esptool
nibble.upload.maximum_data_size=81920
nibble.upload.wait_for_upload_port=false
nibble.upload.erase_cmd=
nibble.serial.disableDTR=true
nibble.serial.disableRTS=true
nibble.build.mcu=esp8266
nibble.build.core=esp8266
nibble.build.spiffs_pagesize=256
nibble.build.debug_port=
nibble.build.debug_level=
nibble.menu.xtal.80=80 MHz
nibble.menu.xtal.80.build.f_cpu=80000000L
nibble.menu.xtal.160=160 MHz
nibble.menu.xtal.160.build.f_cpu=160000000L
nibble.menu.vt.flash=Flash
nibble.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
nibble.menu.vt.heap=Heap
nibble.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
nibble.menu.vt.iram=IRAM
nibble.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
nibble.menu.exception.legacy=Legacy (new can return nullptr)
nibble.menu.exception.legacy.build.exception_flags=-fno-exceptions
nibble.menu.exception.legacy.build.stdcpp_lib=-lstdc++
nibble.menu.exception.disabled=Disabled (new can abort)
nibble.menu.exception.disabled.build.exception_flags=-fno-exceptions -DNEW_OOM_ABORT
nibble.menu.exception.disabled.build.stdcpp_lib=-lstdc++
nibble.menu.exception.enabled=Enabled
nibble.menu.exception.enabled.build.exception_flags=-fexceptions
nibble.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
nibble.menu.ssl.all=All SSL ciphers (most compatible)
nibble.menu.ssl.all.build.sslflags=
nibble.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
nibble.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
nibble.upload.resetmethod=--before default_reset --after hard_reset
nibble.build.flash_mode=qio
nibble.build.flash_flags=-DFLASHMODE_QIO
nibble.build.flash_freq=40
nibble.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
nibble.menu.eesz.4M2M.build.flash_size=4M
nibble.menu.eesz.4M2M.build.flash_size_bytes=0x400000
nibble.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
nibble.menu.eesz.4M2M.build.spiffs_pagesize=256
nibble.menu.eesz.4M2M.upload.maximum_size=1044464
nibble.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
nibble.menu.eesz.4M2M.build.spiffs_start=0x200000
nibble.menu.eesz.4M2M.build.spiffs_end=0x3FA000
nibble.menu.eesz.4M2M.build.spiffs_blocksize=8192
nibble.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
nibble.menu.eesz.4M3M.build.flash_size=4M
nibble.menu.eesz.4M3M.build.flash_size_bytes=0x400000
nibble.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
nibble.menu.eesz.4M3M.build.spiffs_pagesize=256
nibble.menu.eesz.4M3M.upload.maximum_size=1044464
nibble.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
nibble.menu.eesz.4M3M.build.spiffs_start=0x100000
nibble.menu.eesz.4M3M.build.spiffs_end=0x3FA000
nibble.menu.eesz.4M3M.build.spiffs_blocksize=8192
nibble.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
nibble.menu.eesz.4M1M.build.flash_size=4M
nibble.menu.eesz.4M1M.build.flash_size_bytes=0x400000
nibble.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
nibble.menu.eesz.4M1M.build.spiffs_pagesize=256
nibble.menu.eesz.4M1M.upload.maximum_size=1044464
nibble.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
nibble.menu.eesz.4M1M.build.spiffs_start=0x300000
nibble.menu.eesz.4M1M.build.spiffs_end=0x3FA000
nibble.menu.eesz.4M1M.build.spiffs_blocksize=8192
nibble.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
nibble.menu.eesz.4M.build.flash_size=4M
nibble.menu.eesz.4M.build.flash_size_bytes=0x400000
nibble.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
nibble.menu.eesz.4M.build.spiffs_pagesize=256
nibble.menu.eesz.4M.upload.maximum_size=1044464
nibble.menu.eesz.4M.build.rfcal_addr=0x3FC000
nibble.menu.ip.lm2f=v2 Lower Memory
nibble.menu.ip.lm2f.build.lwip_include=lwip2/include
nibble.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
nibble.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
nibble.menu.ip.hb2f=v2 Higher Bandwidth
nibble.menu.ip.hb2f.build.lwip_include=lwip2/include
nibble.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
nibble.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
nibble.menu.ip.lm2n=v2 Lower Memory (no features)
nibble.menu.ip.lm2n.build.lwip_include=lwip2/include
nibble.menu.ip.lm2n.build.lwip_lib=-llwip2-536
nibble.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
nibble.menu.ip.hb2n=v2 Higher Bandwidth (no features)
nibble.menu.ip.hb2n.build.lwip_include=lwip2/include
nibble.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
nibble.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
nibble.menu.ip.lm6f=v2 IPv6 Lower Memory
nibble.menu.ip.lm6f.build.lwip_include=lwip2/include
nibble.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
nibble.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
nibble.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
nibble.menu.ip.hb6f.build.lwip_include=lwip2/include
nibble.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
nibble.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
nibble.menu.ip.hb1=v1.4 Higher Bandwidth
nibble.menu.ip.hb1.build.lwip_lib=-llwip_gcc
nibble.menu.ip.hb1.build.lwip_flags=-DLWIP_OPEN_SRC
nibble.menu.ip.src=v1.4 Compile from source
nibble.menu.ip.src.build.lwip_lib=-llwip_src
nibble.menu.ip.src.build.lwip_flags=-DLWIP_OPEN_SRC
nibble.menu.ip.src.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
nibble.menu.dbg.Disabled=Disabled
nibble.menu.dbg.Disabled.build.debug_port=
nibble.menu.dbg.Serial=Serial
nibble.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
nibble.menu.dbg.Serial1=Serial1
nibble.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
nibble.menu.lvl.None____=None
nibble.menu.lvl.None____.build.debug_level=
nibble.menu.lvl.SSL=SSL
nibble.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
nibble.menu.lvl.TLS_MEM=TLS_MEM
nibble.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
nibble.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
nibble.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
nibble.menu.lvl.HTTP_SERVER=HTTP_SERVER
nibble.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
nibble.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
nibble.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
nibble.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
nibble.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
nibble.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
nibble.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
nibble.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
nibble.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
nibble.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
nibble.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
nibble.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
nibble.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nibble.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
nibble.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
nibble.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
nibble.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
nibble.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
nibble.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nibble.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
nibble.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nibble.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
nibble.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
nibble.menu.lvl.CORE=CORE
nibble.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
nibble.menu.lvl.WIFI=
nibble.menu.lvl.WIFI.build.debug_level=
nibble.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
nibble.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
nibble.menu.lvl.UPDATER=UPDATER
nibble.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
nibble.menu.lvl.OTA=OTA
nibble.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
nibble.menu.lvl.OOM=OOM
nibble.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
nibble.menu.lvl.MDNS=MDNS
nibble.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
nibble.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+UPDATER+OTA+OOM+MDNS
nibble.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
nibble.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+UPDATER+OTA+OOM+MDNS
nibble.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
nibble.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
nibble.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
nibble.menu.wipe.none=Only Sketch
nibble.menu.wipe.none.upload.erase_cmd=
nibble.menu.wipe.sdk=Sketch + WiFi Settings
nibble.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
nibble.menu.wipe.all=All Flash Contents
nibble.menu.wipe.all.upload.erase_cmd=erase_flash
nibble.menu.baud.115200=115200
nibble.menu.baud.115200.upload.speed=115200
nibble.menu.baud.57600=57600
nibble.menu.baud.57600.upload.speed=57600
nibble.menu.baud.230400.linux=230400
nibble.menu.baud.230400.macosx=230400
nibble.menu.baud.230400.upload.speed=230400
nibble.menu.baud.256000.windows=256000
nibble.menu.baud.256000.upload.speed=256000
nibble.menu.baud.460800.linux=460800
nibble.menu.baud.460800.macosx=460800
nibble.menu.baud.460800.upload.speed=460800
nibble.menu.baud.512000.windows=512000
nibble.menu.baud.512000.upload.speed=512000
nibble.menu.baud.921600=921600
nibble.menu.baud.921600.upload.speed=921600
nibble.menu.baud.3000000=3000000
nibble.menu.baud.3000000.upload.speed=3000000

nibble.build.defines=-DCIRCUITOS_LITTLEFS -DCIRCUITOS_TONE -DCIRCUITOS_LOWRAM -DST7735_DRIVER -DTFT_WIDTH=128 -DTFT_HEIGHT=128 -DST7735_GREENTAB128 -DTFT_MOSI=13 -DTFT_SCLK=14 -DTFT_MISO=-1 -DTFT_CS=-1 -DTFT_DC=2 -DTFT_RST=-1 -DSPI_FREQUENCY=27000000
nibble.build.extra_flags=-Os -g

nibble.bootloader.tool=firmburn
nibble.bootloader.tool.firmware=nibble/nibble-v1.0.0.bin


